GigaDevice-GD32-MCU/GD32F470_EVAL_LVGL/Template/GUI_APP/lv_demo_app.c
/**
 * @file lv_demo_app.c
 *
 */

/*********************
 *      INCLUDES
 *********************/
#include "lvgl.h"
#include <stdio.h>
#include "lv_demos.h"
#include "gd32f4xx.h"
#include "lv_file_browse.h"
#include "lv_about.h"
#include "lv_port_disp.h"

/*********************
 *      DEFINES
 *********************/
#define SCALE_POS_X(position) ((lv_coord_t)((position) * LV_HOR_RES_MAX / 1024))
#define SCALE_POS_Y(position) ((lv_coord_t)((position) * LV_VER_RES_MAX / 600))

LV_IMG_DECLARE(img_background);
LV_IMG_DECLARE(img_widget);
LV_IMG_DECLARE(img_music);
LV_IMG_DECLARE(img_speed);
LV_IMG_DECLARE(img_about);
LV_IMG_DECLARE(img_file);
LV_IMG_DECLARE(img_qrcode);
LV_IMG_DECLARE(img_home);
LV_IMG_DECLARE(img_home_pressed);
LV_IMG_DECLARE(img_gd_logo);
LV_IMG_DECLARE(img_picture);
LV_IMG_DECLARE(img_setting);
LV_IMG_DECLARE(img_temp);
LV_IMG_DECLARE(img_mem);

LV_FONT_DECLARE(lv_font_montserrat_8);
LV_FONT_DECLARE(lv_font_digital_20);
LV_FONT_DECLARE(lv_font_digital_30);

uint8_t g_music_flag = 0;

typedef struct {
    uint16_t year;                                                               /*!< RTC year value: 0x0 - 0x99(BCD format) */
    uint8_t month;                                                              /*!< RTC month value */
    uint8_t day;                                                               /*!< RTC date value: 0x1 - 0x31(BCD format) */
    uint8_t hour;                                                               /*!< RTC hour value */
    uint8_t minute;                                                             /*!< RTC minute value: 0x0 - 0x59(BCD format) */
    uint8_t second;                                                   /*!< RTC time notation */
} rtc_para_struct;


const uint8_t month_table[12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
rtc_para_struct rtc_para;
uint32_t seccount;
lv_obj_t *font_label;
lv_obj_t *font_label_year;
lv_obj_t *calendar;

lv_obj_t *tv_main;       /* main page */
lv_obj_t *img;
lv_obj_t *obj_main;
lv_obj_t *obj_performance;
lv_obj_t *imgbtn_widget;
lv_obj_t *imgbtn_music;
lv_obj_t *imgbtn_speed;
lv_obj_t *imgbtn_about;
lv_obj_t *imgbtn_qrcode;
lv_obj_t *imgbtn_file;
lv_obj_t *imgbtn_picture;
lv_obj_t *imgbtn_setting;

lv_obj_t *cpu_chart;
lv_obj_t *fps_chart;
lv_chart_series_t *cpu_chart_series;
lv_chart_series_t *fps_chart_series;

lv_obj_t *led_main;
lv_obj_t *led_performance;

/* Button labels for language switching */
lv_obj_t *label_widget;
lv_obj_t *label_music;
lv_obj_t *label_speed;
lv_obj_t *label_picture;
lv_obj_t *label_about;
lv_obj_t *label_qrcode;
lv_obj_t *label_file;
lv_obj_t *label_setting;

uint32_t g_fps;
uint32_t g_cpu;
lv_mem_monitor_t g_mon;

static lv_timer_t * g_chart_timer;
static lv_timer_t * g_meter_timer;
static lv_timer_t * g_rtc_timer;
static lv_obj_t * touch_cursor;
static bool rtc_initialized;

typedef enum {
    APP_DEMO_NONE,
    APP_DEMO_WIDGETS,
    APP_DEMO_MUSIC,
    APP_DEMO_BENCHMARK,
} app_demo_t;

static app_demo_t active_demo = APP_DEMO_NONE;
static bool return_home_pending;

extern lv_obj_t *list;
extern uint16_t back_to_home;

extern float g_temperature;
extern void update_main_page_language(void);
extern void lv_demo_qrcode(lv_obj_t *parent);
extern void lv_demo_setting(lv_obj_t * parent);
extern void lv_demo_picture(lv_obj_t * parent);
void lv_demo_app(void);

/* 停掉所有持有主页对象的定时器，并把即将被销毁的对象指针置空。
 * demo(widgets/music/benchmark) 会对 lv_scr_act() 执行 lv_obj_clean()，
 * 如果定时器继续访问这些已释放的对象就会出现偶发性卡死/硬件异常。*/
static void app_stop_page_timers(void);

static void return_home_async(void *data)
{
    LV_UNUSED(data);

    return_home_pending = false;

    app_stop_page_timers();

    if(active_demo == APP_DEMO_WIDGETS) {
        lv_demo_widgets_close();
    }
    else if(active_demo == APP_DEMO_MUSIC) {
        lv_demo_music_close();
    }
    else if(active_demo == APP_DEMO_BENCHMARK) {
        lv_demo_benchmark_close();
    }

    active_demo = APP_DEMO_NONE;
    back_to_home = 1;
    lv_demo_app();
}

void lv_demo_app_return_home(void)
{
    if(active_demo != APP_DEMO_NONE && !return_home_pending) {
        return_home_pending = true;
        lv_async_call(return_home_async, NULL);
    }
}

/* Language switching function */
extern void update_main_page_language(void);
/**********************
 *      TYPEDEFS
 **********************/

/**********************
 *  STATIC VARIABLES
 **********************/
bool lv_img_bin_load(const char *path, uint8_t *buf, uint32_t expected_size)
{
if(!path || !buf || expected_size == 0) return false;

    lv_fs_file_t f;
    lv_fs_res_t res = lv_fs_open(&f, path, LV_FS_MODE_RD);
    if(res != LV_FS_RES_OK) return false;

    /* Get total file size first */
    uint32_t size_total = 0;
    res = lv_fs_seek(&f, 0, LV_FS_SEEK_END);
    if(res != LV_FS_RES_OK) { lv_fs_close(&f); return false; }

    res = lv_fs_tell(&f, &size_total);
    if(res != LV_FS_RES_OK) { lv_fs_close(&f); return false; }

    /* Move to payload start (skip 4 bytes header if present) */
    const uint32_t skip = 4;
    if(size_total < skip) { lv_fs_close(&f); return false; }
    uint32_t size = size_total - skip;

    res = lv_fs_seek(&f, (int32_t)skip, LV_FS_SEEK_SET);
    if(res != LV_FS_RES_OK) { lv_fs_close(&f); return false; }

    if(size > expected_size) {
        /* Buffer too small for file */
        lv_fs_close(&f);
        return false;
    }

    uint32_t read_total = 0;
    while(read_total < size) {
        uint32_t to_read = size - read_total;
        if(to_read > 1024) to_read = 1024; /* chunk read */
        uint32_t br = 0;
        res = lv_fs_read(&f, buf + read_total, to_read, &br);
        if(res != LV_FS_RES_OK) { lv_fs_close(&f); return false; }
        if(br == 0) break; /* EOF */
        read_total += br;
    }

    lv_fs_close(&f);
    return read_total == size;
}

static void widget_event_cb(lv_event_t *e)
{
    LV_UNUSED(e);
    if(active_demo != APP_DEMO_NONE) return;

    back_to_home = 0;
    active_demo = APP_DEMO_WIDGETS;

    lv_obj_add_flag(led_main, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(led_performance, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(tv_main, LV_OBJ_FLAG_HIDDEN);

    /* 在 lv_demo_widgets() 内部会 lv_obj_clean(lv_scr_act())，
     * 必须先停掉仍引用主页对象的定时器，否则可能访问已释放内存导致卡死。*/
    app_stop_page_timers();
    lv_demo_widgets();
}

static void music_event_cb(lv_event_t *e)
{
    LV_UNUSED(e);
    if(active_demo != APP_DEMO_NONE) return;

