GigaDevice-GD32-MCU/GD32F470_EVAL_LVGL/Template/GUI_APP/lv_demo_app.c
    back_to_home = 0;
    active_demo = APP_DEMO_MUSIC;

    lv_obj_add_flag(led_main, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(led_performance, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(tv_main, LV_OBJ_FLAG_HIDDEN);

    app_stop_page_timers();
    lv_demo_music();
}

static void start_benchmark_cb(lv_timer_t * t)
{
    LV_UNUSED(t);

    lv_obj_add_flag(tv_main, LV_OBJ_FLAG_HIDDEN);

    /* benchmark 结束时会 lv_obj_clean(lv_scr_act()) 来显示结果表格，
     * 主页对象会被一并删掉，所以必须先把引用它们的定时器全部停掉。*/
    app_stop_page_timers();

    lv_demo_benchmark();
}

static void speed_event_cb(lv_event_t *e)
{
    LV_UNUSED(e);
    if(active_demo != APP_DEMO_NONE) return;

    back_to_home = 0;
    active_demo = APP_DEMO_BENCHMARK;
    lv_timer_t * timer = lv_timer_create(start_benchmark_cb, 1, NULL);
    if(timer) {
        lv_timer_set_repeat_count(timer, 1);
    }
    else {
        active_demo = APP_DEMO_NONE;
    }
}

static void qrcode_event_cb(lv_event_t *e)
{
    lv_obj_add_flag(led_main, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(led_performance, LV_OBJ_FLAG_HIDDEN);
    lv_demo_qrcode(lv_event_get_user_data(e));
    lv_obj_add_flag(obj_performance, LV_OBJ_FLAG_HIDDEN);
}

static void setting_event_cb(lv_event_t *e)
{
    lv_demo_setting(lv_event_get_user_data(e));
    lv_obj_add_flag(obj_performance, LV_OBJ_FLAG_HIDDEN);
}

static void picture_event_cb(lv_event_t *e)
{
    lv_demo_picture(lv_event_get_user_data(e));
    lv_obj_add_flag(obj_performance, LV_OBJ_FLAG_HIDDEN);
}
 
static void close_event_cb(lv_event_t *e)
{
    back_to_home = 1;
    lv_obj_clear_state(imgbtn_music, LV_STATE_DISABLED);
    lv_obj_clear_state(imgbtn_speed, LV_STATE_DISABLED);
    lv_obj_clear_state(imgbtn_about, LV_STATE_DISABLED);
    lv_obj_clear_state(imgbtn_widget, LV_STATE_DISABLED);
//    lv_obj_add_flag(obj_about, LV_OBJ_FLAG_HIDDEN);
    lv_obj_del(lv_event_get_user_data(e));
}

static void update_demo_performance_stats(void)
{
    static uint32_t sample_index;
    static uint32_t random_state = 0x470F470U;
    static int32_t cpu_filtered = 18;
    uint32_t target_cpu;
    int32_t noise;

    random_state = random_state * 1664525U + 1013904223U;
    noise = (int32_t)((random_state >> 28) & 0x0FU) - 7;

    /* 模拟界面在空闲、活跃、偶发繁忙阶段之间切换的负载曲线。*/
    switch((sample_index / 12U) % 5U) {
    case 0:
        target_cpu = 13U;
        break;
    case 1:
        target_cpu = 24U;
        break;
    case 2:
        target_cpu = 39U;
        break;
    case 3:
        target_cpu = 29U;
        break;
    default:
        target_cpu = 17U;
        break;
    }

    if(sample_index % 29U == 0U) target_cpu += 22U;

    cpu_filtered += ((int32_t)target_cpu + noise - cpu_filtered) / 2;
    if(cpu_filtered < 5) cpu_filtered = 5;
    if(cpu_filtered > 85) cpu_filtered = 85;

    g_cpu = (uint32_t)cpu_filtered;
    g_fps = 40U - g_cpu / 8U + ((random_state >> 24) & 0x01U);
    if(g_fps < 28U) g_fps = 28U;

    sample_index++;
}

static void update_chart(lv_timer_t *timer)
{
    LV_UNUSED(timer);

    if(cpu_chart == NULL || fps_chart == NULL) return;

    update_demo_performance_stats();
    lv_chart_set_next_value(cpu_chart, cpu_chart_series, g_cpu);
    lv_chart_set_next_value(fps_chart, fps_chart_series, g_fps);
}

static void calendar_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *obj = lv_event_get_current_target(e);

    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_calendar_date_t date;
        if(lv_calendar_get_pressed_date(obj, &date)) {

            rtc_para.year = date.year;
            rtc_para.month = date.month;
            rtc_para.day = date.day;
            lv_label_set_text_fmt(font_label_year, "#FFFFFF %d/%02d/%02d", rtc_para.year, rtc_para.month, rtc_para.day);

            lv_obj_del(calendar);
            calendar = NULL;
            lv_obj_clear_flag(lv_layer_top(), LV_OBJ_FLAG_CLICKABLE);
            lv_obj_set_style_bg_opa(lv_layer_top(), LV_OPA_TRANSP, 0);
        }

    }
}

static void year_label_evevt_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *obj = lv_event_get_current_target(e);

    if(code == LV_EVENT_CLICKED) {
        lv_obj_add_flag(lv_layer_top(), LV_OBJ_FLAG_CLICKABLE);
        calendar = lv_calendar_create(lv_layer_top());
        lv_obj_set_style_bg_opa(lv_layer_top(), LV_OPA_50, 0);
        lv_obj_set_style_bg_color(lv_layer_top(), lv_palette_main(LV_PALETTE_GREY), 0);

        lv_obj_set_size(calendar, SCALE_POS_X(400), SCALE_POS_Y(400));
        lv_obj_align_to(calendar, font_label_year, LV_ALIGN_LEFT_MID, SCALE_POS_X(0), SCALE_POS_Y(0));
        static lv_calendar_date_t highlighted_days[1];       /*Only its pointer will be saved so should be static*/
        highlighted_days[0].year = rtc_para.year;
        highlighted_days[0].month = rtc_para.month;
        highlighted_days[0].day = rtc_para.day;
        lv_calendar_set_highlighted_dates(calendar, highlighted_days, 1);

        lv_calendar_set_showed_date(calendar, rtc_para.year, rtc_para.month);
        lv_calendar_header_dropdown_create(calendar);
        lv_calendar_header_arrow_create(calendar);
        lv_obj_add_event_cb(calendar, calendar_event_cb, LV_EVENT_ALL, NULL);
    }
}



uint8_t is_leap_year(uint16_t year)
{
    if((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0)) {
        return 1;
    } else {
        return 0;
    }
}

uint32_t rtc_seccount_get(rtc_para_struct *rtc_initpara_struct)
{
    uint16_t t;
    uint32_t sec = 0;

    if(rtc_initpara_struct->year < 1970 || rtc_initpara_struct->year > 2099) {
        return 1;
    }

    for(t = 1970; t < rtc_initpara_struct->year; t++) {
        if(is_leap_year(t)) {
            sec += 31622400;
        } else {
            sec += 31536000;
        }
    }
    //rtc_initpara_struct->month -= 1;

    for(t = 0; t < rtc_initpara_struct->month - 1; t++) {
        sec += (uint32_t)month_table[t] * 86400;
        if(is_leap_year(rtc_initpara_struct->year) && t == 1) {
            sec += 86400;
        }
    }

    sec += (uint32_t)(rtc_initpara_struct->day - 1) * 86400;
    sec += (uint32_t)rtc_initpara_struct->hour * 3600;
    sec += (uint32_t)rtc_initpara_struct->minute * 60;
    sec += rtc_initpara_struct->second;
    //rtc_counter_set(sec);
    return sec;
}

void rtc_time_get(uint32_t timevar, rtc_para_struct *rtc_initpara_struct)
{
    static uint16_t daycnt = 0;
    uint32_t temp = 0;
    uint16_t temp1 = 0;
    temp = timevar / 86400;

    if(daycnt != temp) {
        daycnt = temp;
        temp1 = 1970;

