GigaDevice-GD32-MCU/GD32F470_EVAL_LVGL/Template/GUI_APP/lv_demo_app.c
        while(temp >= 365) {
            if(is_leap_year(temp1)) {
                if(temp >= 366) {
                    temp -= 366;
                } else {
                    break;
                }
            } else {
                temp -= 365;
            }
            temp1++;
        }

        rtc_initpara_struct->year = temp1;
        temp1 = 0;

        while(temp >= 28) {
            if(is_leap_year(rtc_initpara_struct->year) && temp1 == 1) {
                if(temp >= 29) {
                    temp -= 29;
                } else {
                    break;
                }
            } else {
                if(temp >= month_table[temp1]) {
                    temp -= month_table[temp1];
                } else {
                    break;
                }
            }
            temp1++;
        }
        rtc_initpara_struct->month = temp1 + 1;
        rtc_initpara_struct->day = temp + 1;
    }

    temp = timevar % 86400;
    rtc_initpara_struct->hour = temp / 3600;
    rtc_initpara_struct->minute = (temp % 3600) / 60;
    rtc_initpara_struct->second = (temp % 3600) % 60;
}

static void rtc_timer(lv_timer_t *timer)
{
    seccount = rtc_seccount_get(&rtc_para);
    rtc_seccount_get(&rtc_para);
    seccount++;
    rtc_time_get(seccount, &rtc_para);

    if(font_label) {
        lv_label_set_text_fmt(font_label, "#FFFFFF %02d:%02d:%02d", rtc_para.hour, rtc_para.minute, rtc_para.second);
    }
    if(font_label_year) {
        lv_label_set_text_fmt(font_label_year, "#FFFFFF %d/%02d/%02d", rtc_para.year, rtc_para.month, rtc_para.day);
    }

}
static lv_obj_t *mem_meter;

static void mem_set_value(void *indic, int32_t v)
{
    lv_meter_set_indicator_end_value(mem_meter, indic, v);
}

static lv_obj_t *temp_mem_meter;
static lv_meter_indicator_t *indic_temp;
lv_obj_t * label_temp;

static void tv_main_event_cb(lv_event_t *e)
{
    if(lv_event_get_code(e) == LV_EVENT_VALUE_CHANGED) {
        if(0 == lv_tabview_get_tab_act(tv_main)) {
            lv_led_on(led_main);
            lv_led_off(led_performance);
            back_to_home = 1;
        } else if(1 == lv_tabview_get_tab_act(tv_main)) {
            lv_led_off(led_main);
            lv_led_on(led_performance);
        }
    }
}

//lv_event_code_t testtt;

static lv_meter_indicator_t * indic_total_size;
lv_obj_t * label_total_size;
static lv_meter_indicator_t * indic_mem_used;
lv_obj_t * label_mem_used;
static lv_meter_indicator_t * indic_frag;
lv_obj_t * label_frag;
//static void scroll_begin_event(lv_event_t * e)
//{
//    /*Disable the scroll animations. Triggered when a tab button is clicked */
////    if(lv_event_get_code(e) == LV_EVENT_SCROLL_BEGIN) {
//    testtt = lv_event_get_code(e);
//    if( LV_EVENT_DRAW_POST_END == lv_event_get_code(e))
//        back_to_home = 0;
////    }
//}

//lv_event_code_t testtt2;
//static void scroll_begin_event2(lv_event_t * e)
//{
//    /*Disable the scroll animations. Triggered when a tab button is clicked */
////    if(lv_event_get_code(e) == LV_EVENT_SCROLL_BEGIN) {
//    testtt2 = lv_event_get_code(e);
//    if( LV_EVENT_DRAW_POST_END == lv_event_get_code(e))
//        back_to_home = 1;
////    }
//}


static void update_meter_box(lv_timer_t *timer)
{
    LV_UNUSED(timer);

    lv_mem_monitor(&g_mon);
    
    lv_meter_set_indicator_end_value(mem_meter, indic_total_size, 100);
    lv_meter_set_indicator_end_value(mem_meter, indic_mem_used, g_mon.used_pct);
    lv_meter_set_indicator_end_value(mem_meter, indic_frag, g_mon.frag_pct);

    /* Use update_main_page_language to update labels with proper language and font */
    update_main_page_language();
    
    lv_meter_set_indicator_value(temp_mem_meter, indic_temp, (int32_t)g_temperature);
}

static void create_meter_box(lv_obj_t * parent, const char * title, const char * text1, const char * text2,
                                   const char * text3)
{
    static lv_style_t style_title;
    lv_style_init(&style_title);


    static lv_style_t style_bullet;
    lv_style_init(&style_bullet);
    lv_style_set_border_width(&style_bullet, 0);
    lv_style_set_radius(&style_bullet, LV_RADIUS_CIRCLE);


    lv_obj_t * cont = lv_obj_create(parent);
    lv_obj_set_height(cont, LV_SIZE_CONTENT);
    lv_obj_set_width(cont, 140);
    lv_obj_set_flex_grow(cont, 1);
    lv_obj_set_pos(cont, SCALE_POS_X(165), 500);

    lv_obj_t * bullet1 = lv_obj_create(cont);
    lv_obj_set_size(bullet1, SCALE_POS_X(13), SCALE_POS_Y(13));
    lv_obj_remove_style(bullet1, NULL, LV_PART_SCROLLBAR);
    lv_obj_add_style(bullet1, &style_bullet, 0);
    lv_obj_set_style_bg_color(bullet1, lv_palette_main(LV_PALETTE_RED), 0);
    label_total_size = lv_label_create(cont);
    lv_label_set_text(label_total_size, text1);

    lv_obj_t * bullet2 = lv_obj_create(cont);
    lv_obj_set_size(bullet2, SCALE_POS_X(13), SCALE_POS_Y(13));
    lv_obj_remove_style(bullet2, NULL, LV_PART_SCROLLBAR);
    lv_obj_add_style(bullet2, &style_bullet, 0);
    lv_obj_set_style_bg_color(bullet2, lv_palette_main(LV_PALETTE_GREEN), 0);
    label_mem_used = lv_label_create(cont);
    lv_label_set_text(label_mem_used, text2);

    lv_obj_t * bullet3 = lv_obj_create(cont);
    lv_obj_set_size(bullet3, SCALE_POS_X(13), SCALE_POS_Y(13));
    lv_obj_remove_style(bullet3,  NULL, LV_PART_SCROLLBAR);
    lv_obj_add_style(bullet3, &style_bullet, 0);
    lv_obj_set_style_bg_color(bullet3, lv_palette_main(LV_PALETTE_BLUE), 0);
    label_frag = lv_label_create(cont);
    lv_label_set_text(label_frag, text3);

    {
        static lv_coord_t grid_col_dsc[] = {LV_GRID_CONTENT, LV_GRID_FR(1), LV_GRID_TEMPLATE_LAST};
//        static lv_coord_t grid_row_dsc[] = {LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_TEMPLATE_LAST};
        static lv_coord_t grid_row_dsc[] = {LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_TEMPLATE_LAST};
        lv_obj_set_grid_dsc_array(cont, grid_col_dsc, grid_row_dsc);
//        lv_obj_set_grid_cell(title_label, LV_GRID_ALIGN_START, 0, 2, LV_GRID_ALIGN_START, 0, 1);
//        lv_obj_set_grid_cell(meter, LV_GRID_ALIGN_START, 0, 2, LV_GRID_ALIGN_START, 1, 1);
        lv_obj_set_grid_cell(bullet1, LV_GRID_ALIGN_START, 0, 1, LV_GRID_ALIGN_START, 0, 1);
        lv_obj_set_grid_cell(bullet2, LV_GRID_ALIGN_START, 0, 1, LV_GRID_ALIGN_START, 1, 1);
        lv_obj_set_grid_cell(bullet3, LV_GRID_ALIGN_START, 0, 1, LV_GRID_ALIGN_START, 2, 1);
        lv_obj_set_grid_cell(label_total_size, LV_GRID_ALIGN_STRETCH, 1, 1, LV_GRID_ALIGN_START, 0, 1);
        lv_obj_set_grid_cell(label_mem_used, LV_GRID_ALIGN_STRETCH, 1, 1, LV_GRID_ALIGN_START, 1, 1);
        lv_obj_set_grid_cell(label_frag, LV_GRID_ALIGN_STRETCH, 1, 1, LV_GRID_ALIGN_START, 2, 1);
    }

