GigaDevice-GD32-MCU/GD32F470_EVAL_LVGL/Template/GUI_APP/lv_demo_app.c
}

static void create_temp_box(lv_obj_t * parent, const char * text1)
{
    static lv_style_t style_title;
    lv_style_init(&style_title);


    static lv_style_t style_bullet;
    lv_style_init(&style_bullet);
    lv_style_set_border_width(&style_bullet, 0);
    lv_style_set_radius(&style_bullet, LV_RADIUS_CIRCLE);


    lv_obj_t * cont = lv_obj_create(parent);
    lv_obj_set_height(cont, LV_SIZE_CONTENT);
    lv_obj_set_width(cont, 140);
    lv_obj_set_flex_grow(cont, 1);
    lv_obj_set_pos(cont, SCALE_POS_X(165+465), 500);

    lv_obj_t * bullet1 = lv_obj_create(cont);
    lv_obj_set_size(bullet1, SCALE_POS_X(13), SCALE_POS_Y(13));
    lv_obj_remove_style(bullet1, NULL, LV_PART_SCROLLBAR);
    lv_obj_add_style(bullet1, &style_bullet, 0);
    lv_obj_set_style_bg_color(bullet1, lv_palette_main(LV_PALETTE_GREY), 0);
    label_temp = lv_label_create(cont);
    lv_label_set_text(label_temp, text1);

    {
        static lv_coord_t grid_col_dsc[] = {LV_GRID_CONTENT, LV_GRID_FR(1), LV_GRID_TEMPLATE_LAST};
//        static lv_coord_t grid_row_dsc[] = {LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_TEMPLATE_LAST};
        static lv_coord_t grid_row_dsc[] = {LV_GRID_CONTENT, LV_GRID_CONTENT, LV_GRID_TEMPLATE_LAST};
        lv_obj_set_grid_dsc_array(cont, grid_col_dsc, grid_row_dsc);
//        lv_obj_set_grid_cell(title_label, LV_GRID_ALIGN_START, 0, 2, LV_GRID_ALIGN_START, 0, 1);
//        lv_obj_set_grid_cell(meter, LV_GRID_ALIGN_START, 0, 2, LV_GRID_ALIGN_START, 1, 1);
        lv_obj_set_grid_cell(bullet1, LV_GRID_ALIGN_START, 0, 1, LV_GRID_ALIGN_START, 0, 1);
        lv_obj_set_grid_cell(label_temp, LV_GRID_ALIGN_STRETCH, 1, 1, LV_GRID_ALIGN_START, 0, 1);
    }

}
/**********************
 *      MACROS
 **********************/

static void app_stop_page_timers(void)
{
    if(g_chart_timer) {
        lv_timer_del(g_chart_timer);
        g_chart_timer = NULL;
    }
    if(g_meter_timer) {
        lv_timer_del(g_meter_timer);
        g_meter_timer = NULL;
    }
    if(g_rtc_timer) {
        lv_timer_del(g_rtc_timer);
        g_rtc_timer = NULL;
    }

    font_label = NULL;
    font_label_year = NULL;

    label_widget = NULL;
    label_music = NULL;
    label_speed = NULL;
    label_picture = NULL;
    label_about = NULL;
    label_qrcode = NULL;
    label_file = NULL;
    label_setting = NULL;

    label_total_size = NULL;
    label_mem_used = NULL;
    label_frag = NULL;
    label_temp = NULL;

    cpu_chart = NULL;
    fps_chart = NULL;
    mem_meter = NULL;
    temp_mem_meter = NULL;

    tv_main = NULL;
    obj_main = NULL;
    obj_performance = NULL;
    led_main = NULL;
    led_performance = NULL;

    if(calendar) {
        lv_obj_del(calendar);
        calendar = NULL;
        lv_obj_clear_flag(lv_layer_top(), LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_style_bg_opa(lv_layer_top(), LV_OPA_TRANSP, 0);
    }
}

/**********************
 *   GLOBAL FUNCTIONS
 **********************/

void lv_demo_app(void)
{
//    static lv_obj_t *tv_main;       /* main page */
    tv_main = lv_tabview_create(lv_scr_act(), LV_DIR_TOP, 0);
    lv_obj_add_event_cb(tv_main, tv_main_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    /*Create a LED and switch it OFF*/
    led_main  = lv_led_create(lv_scr_act());
    lv_obj_set_size(led_main, 10, 10);
    lv_obj_align(led_main, LV_ALIGN_CENTER, SCALE_POS_X(-30), SCALE_POS_Y(250));
    lv_led_on(led_main);
//    lv_obj_add_event_cb(led_main, scroll_begin_event2, LV_EVENT_ALL, NULL);

    /*Copy the previous LED and set a brightness*/
    led_performance  = lv_led_create(lv_scr_act());
    lv_obj_set_size(led_performance, 10, 10);
    lv_obj_align(led_performance, LV_ALIGN_CENTER, SCALE_POS_X(30), SCALE_POS_Y(250));
//    lv_led_set_color(led2, lv_palette_main(LV_PALETTE_LIGHT_GREEN));
    lv_led_off(led_performance);
//    lv_obj_add_event_cb(led_performance, scroll_begin_event, LV_EVENT_ALL, NULL);


    obj_main = lv_tabview_add_tab(tv_main, "Main page");
    obj_performance = lv_tabview_add_tab(tv_main, "Performance");

    lv_obj_set_width(obj_main, LV_HOR_RES_MAX);
    lv_obj_set_height(obj_main, LV_VER_RES_MAX);

    lv_obj_set_scrollbar_mode(obj_main, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_style_pad_top(obj_main, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_bottom(obj_main, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_left(obj_main, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_right(obj_main, 0, LV_PART_MAIN);
    lv_obj_set_style_border_width(obj_main, 0, LV_PART_MAIN);

    lv_obj_set_width(obj_performance, LV_HOR_RES_MAX);
    lv_obj_set_height(obj_performance, LV_VER_RES_MAX);

    lv_obj_clear_flag(obj_main, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_scrollbar_mode(obj_performance, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_style_pad_top(obj_performance, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_bottom(obj_performance, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_left(obj_performance, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_right(obj_performance, 0, LV_PART_MAIN);
    lv_obj_set_style_border_width(obj_performance, 0, LV_PART_MAIN);

    img = lv_img_create(obj_main);
    lv_img_set_src(img, &img_background);

    imgbtn_widget = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_widget, LV_IMGBTN_STATE_PRESSED, &img_widget, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_widget, LV_IMGBTN_STATE_RELEASED, &img_widget, NULL, NULL);
//    lv_obj_set_size(imgbtn_widget, 100, 100);
    lv_obj_set_pos(imgbtn_widget, SCALE_POS_X(390), SCALE_POS_Y(207));

    imgbtn_music = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_music, LV_IMGBTN_STATE_PRESSED, &img_music, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_music, LV_IMGBTN_STATE_RELEASED, &img_music, NULL, NULL);
//    lv_obj_set_size(imgbtn_music, 100, 100);
    lv_obj_set_pos(imgbtn_music, SCALE_POS_X(524), SCALE_POS_Y(207));

    imgbtn_speed = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_speed, LV_IMGBTN_STATE_PRESSED, &img_speed, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_speed, LV_IMGBTN_STATE_RELEASED, &img_speed, NULL, NULL);
//    lv_obj_set_size(imgbtn_speed, 100, 100);
    lv_obj_set_pos(imgbtn_speed, SCALE_POS_X(657), SCALE_POS_Y(207));

