GigaDevice-GD32-MCU/GD32F470_EVAL_LVGL/Template/GUI_APP/lv_demo_app.c
    imgbtn_picture = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_picture, LV_IMGBTN_STATE_PRESSED, &img_picture, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_picture, LV_IMGBTN_STATE_RELEASED, &img_picture, NULL, NULL);
//    lv_obj_set_size(imgbtn_file, 100, 100);
    lv_obj_set_pos(imgbtn_picture, SCALE_POS_X(783), SCALE_POS_Y(207));

    imgbtn_about = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_about, LV_IMGBTN_STATE_PRESSED, &img_about, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_about, LV_IMGBTN_STATE_RELEASED, &img_about, NULL, NULL);
//    lv_obj_set_size(imgbtn_about, 100, 100);
    lv_obj_set_pos(imgbtn_about, SCALE_POS_X(390), SCALE_POS_Y(350));

    imgbtn_qrcode = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_qrcode, LV_IMGBTN_STATE_PRESSED, &img_qrcode, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_qrcode, LV_IMGBTN_STATE_RELEASED, &img_qrcode, NULL, NULL);
//    lv_obj_set_size(imgbtn_qrcode, 100, 100);
    lv_obj_set_pos(imgbtn_qrcode, SCALE_POS_X(524), SCALE_POS_Y(350));

    imgbtn_file = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_file, LV_IMGBTN_STATE_PRESSED, &img_file, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_file, LV_IMGBTN_STATE_RELEASED, &img_file, NULL, NULL);
//    lv_obj_set_size(imgbtn_file, 100, 100);
    lv_obj_set_pos(imgbtn_file, SCALE_POS_X(657), SCALE_POS_Y(350));

    imgbtn_setting = lv_imgbtn_create(obj_main);
    lv_imgbtn_set_src(imgbtn_setting, LV_IMGBTN_STATE_PRESSED, &img_setting, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_setting, LV_IMGBTN_STATE_RELEASED, &img_setting, NULL, NULL);
//    lv_obj_set_size(imgbtn_file, 100, 100);
    lv_obj_set_pos(imgbtn_setting, SCALE_POS_X(783), SCALE_POS_Y(350));

    // /* Add labels under each button */
    label_widget = lv_label_create(obj_main);
    lv_label_set_text(label_widget, "Widget");
    lv_obj_set_style_text_font(label_widget, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_widget, imgbtn_widget, LV_ALIGN_OUT_BOTTOM_MID, -48, -90);


    label_music = lv_label_create(obj_main);
    lv_label_set_text(label_music, "Music");
    lv_obj_set_style_text_font(label_music, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_music, imgbtn_music, LV_ALIGN_OUT_BOTTOM_MID,  -48, -90);

    label_speed = lv_label_create(obj_main);
    lv_label_set_text(label_speed, "Benchmark");
    lv_obj_set_style_text_font(label_speed, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_speed, imgbtn_speed, LV_ALIGN_OUT_BOTTOM_MID, -48, -90);

    label_picture = lv_label_create(obj_main);
    lv_label_set_text(label_picture, "Picture");
    lv_obj_set_style_text_font(label_picture, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_picture, imgbtn_picture, LV_ALIGN_OUT_BOTTOM_MID, -48, -90);

    label_about = lv_label_create(obj_main);
    lv_label_set_text(label_about, "About");
    lv_obj_set_style_text_font(label_about, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_about, imgbtn_about, LV_ALIGN_OUT_BOTTOM_MID, -48, -90);

    label_qrcode = lv_label_create(obj_main);
    lv_label_set_text(label_qrcode, "QRCode");
    lv_obj_set_style_text_font(label_qrcode, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_qrcode, imgbtn_qrcode, LV_ALIGN_OUT_BOTTOM_MID, -48, -90);

    label_file = lv_label_create(obj_main);
    lv_label_set_text(label_file, "File");
    lv_obj_set_style_text_font(label_file, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_file, imgbtn_file, LV_ALIGN_OUT_BOTTOM_MID, -48, -90);

    label_setting = lv_label_create(obj_main);
    lv_label_set_text(label_setting, "Setting");
    lv_obj_set_style_text_font(label_setting, &lv_font_montserrat_10, LV_STATE_DEFAULT);
    lv_obj_align_to(label_setting, imgbtn_setting, LV_ALIGN_OUT_BOTTOM_MID, -48, -90);

    //Write codes CPU usage chart
    cpu_chart = lv_chart_create(obj_performance);

    lv_obj_set_pos(cpu_chart, SCALE_POS_X(7 + 75), 19);
    lv_obj_set_size(cpu_chart, SCALE_POS_X(1004 - 75), 155);
    lv_chart_set_type(cpu_chart, LV_CHART_TYPE_LINE);
    lv_chart_set_range(cpu_chart, LV_CHART_AXIS_PRIMARY_Y, 0, 100);
    lv_chart_set_div_line_count(cpu_chart, 6, 12);
    cpu_chart_series = lv_chart_add_series(cpu_chart, lv_color_make(0x50, 0x0A, 0x88), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_set_axis_tick(cpu_chart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 5, true, 30);
    lv_chart_set_point_count(cpu_chart, 20);

    //Write codes FPS chart
    fps_chart = lv_chart_create(obj_performance);

    lv_obj_set_pos(fps_chart, SCALE_POS_X(7 + 75), 198);
    lv_obj_set_size(fps_chart, SCALE_POS_X(1004 - 75), 155);
    lv_chart_set_type(fps_chart, LV_CHART_TYPE_LINE);
    lv_chart_set_range(fps_chart, LV_CHART_AXIS_SECONDARY_Y, 0, 100);
    lv_chart_set_div_line_count(fps_chart, 6, 12);
    fps_chart_series = lv_chart_add_series(fps_chart, lv_palette_main(LV_PALETTE_ORANGE), LV_CHART_AXIS_SECONDARY_Y);
    lv_chart_set_axis_tick(fps_chart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 5, true, 30);
    lv_chart_set_point_count(fps_chart, 20);

    /* 用符合实际曲线走势的虚拟数据预先填满两个图表，避免刚进入性能页时是空的 */
    for(uint32_t index = 0; index < 20U; index++) {
        update_demo_performance_stats();
        lv_chart_set_next_value(cpu_chart, cpu_chart_series, g_cpu);
        lv_chart_set_next_value(fps_chart, fps_chart_series, g_fps);
    }

    //Write codes CPU usage label
    lv_obj_t *cpu_label = lv_label_create(obj_performance);
    lv_obj_set_style_text_font(cpu_label, LV_FONT_DEFAULT, LV_STATE_DEFAULT);
    lv_label_set_recolor(cpu_label, true);                      /*Enable re-coloring by commands in the text*/
    lv_label_set_text(cpu_label, "#F12F12 CPU usage(%)");

    lv_label_set_long_mode(cpu_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_pos(cpu_label, SCALE_POS_X(21), 2);
    //Write codes FPS label
    lv_obj_t *fps_label = lv_label_create(obj_performance);
    lv_obj_set_style_text_font(fps_label, LV_FONT_DEFAULT, LV_STATE_DEFAULT);
    lv_label_set_recolor(fps_label, true);                      /*Enable re-coloring by commands in the text*/
    lv_label_set_text(fps_label, "#F12F12 FPS");

