GigaDevice-GD32-MCU/GD32F470_EVAL_LVGL/Template/GUI_APP/lv_demo_app.c
    lv_label_set_long_mode(fps_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_pos(fps_label, SCALE_POS_X(21), 182);

    g_chart_timer = lv_timer_create(update_chart, 500, NULL);

    /* 内存表盘 */
    lv_mem_monitor(&g_mon);
    mem_meter = lv_meter_create(obj_performance);
    lv_obj_set_pos(mem_meter, SCALE_POS_X(130), 357);
    lv_obj_set_size(mem_meter, SCALE_POS_X(300), SCALE_POS_X(300));

    /* Make tick lines closer to the dial rim: remove default padding/border so the meter content radius grows */
    lv_obj_set_style_pad_all(mem_meter, 10, LV_PART_MAIN);
    lv_obj_set_style_border_width(mem_meter, 0, LV_PART_MAIN);

    /*Remove the circle from the middle*/
    lv_obj_remove_style(mem_meter, NULL, LV_PART_INDICATOR);

    /*Add a scale first*/
    lv_meter_scale_t *mem_scale = lv_meter_add_scale(mem_meter);
    lv_meter_set_scale_ticks(mem_meter, mem_scale, 6, 2, 10, lv_palette_main(LV_PALETTE_GREY));
    lv_meter_set_scale_major_ticks(mem_meter, mem_scale, 1, 2, 10, lv_color_hex3(0xeee), 15);
    lv_meter_set_scale_range(mem_meter, mem_scale, 0, 100, 270, 90);

    /*Add a three arc indicator*/
    indic_total_size = lv_meter_add_arc(mem_meter, mem_scale, 5, lv_palette_main(LV_PALETTE_RED), 0);
    indic_mem_used = lv_meter_add_arc(mem_meter, mem_scale, 5, lv_palette_main(LV_PALETTE_GREEN), -5);
    indic_frag = lv_meter_add_arc(mem_meter, mem_scale, 5, lv_palette_main(LV_PALETTE_BLUE), -10);

    /*Create an animation to set the value*/
    lv_anim_t a_mem;
    lv_anim_init(&a_mem);
//    lv_anim_set_exec_cb(&a_mem, mem_set_value);
    lv_anim_set_values(&a_mem, 0, 100);
    lv_anim_set_repeat_delay(&a_mem, 100);
    lv_anim_set_playback_delay(&a_mem, 100);
    lv_anim_set_repeat_count(&a_mem, LV_ANIM_REPEAT_INFINITE);

    lv_anim_set_time(&a_mem, 2000);
    lv_anim_set_playback_time(&a_mem, 500);
    lv_anim_set_var(&a_mem, indic_total_size);
    lv_anim_start(&a_mem);

    lv_anim_set_time(&a_mem, 1000);
    lv_anim_set_playback_time(&a_mem, 1000);
    lv_anim_set_var(&a_mem, indic_mem_used);
    lv_anim_start(&a_mem);

    lv_anim_set_time(&a_mem, 1000);
    lv_anim_set_playback_time(&a_mem, 2000);
    lv_anim_set_var(&a_mem, indic_frag);
    lv_anim_start(&a_mem);

    lv_meter_set_indicator_end_value(mem_meter, indic_total_size, 100);
    lv_meter_set_indicator_end_value(mem_meter, indic_mem_used, 20);
    lv_meter_set_indicator_end_value(mem_meter, indic_frag, 80);

    /* 温度表盘 */
    temp_mem_meter = lv_meter_create(obj_performance);
    lv_obj_set_pos(temp_mem_meter, SCALE_POS_X(588), 357);
    lv_obj_set_size(temp_mem_meter, SCALE_POS_X(300), SCALE_POS_X(300));

    /* Make tick lines closer to the dial rim: remove default padding/border so the meter content radius grows */
    lv_obj_set_style_pad_all(temp_mem_meter, 10, LV_PART_MAIN);
    lv_obj_set_style_border_width(temp_mem_meter, 0, LV_PART_MAIN);

    /*Add a scale first*/
    lv_meter_scale_t *temp_scale = lv_meter_add_scale(temp_mem_meter);
    lv_meter_set_scale_ticks(temp_mem_meter, temp_scale, 31, 1, 6, lv_palette_main(LV_PALETTE_GREY));
    lv_meter_set_scale_major_ticks(temp_mem_meter, temp_scale, 5, 2, 15, lv_color_black(), 5);
    lv_meter_set_scale_range(temp_mem_meter, temp_scale, -40, 105, 270, 180 - 45);

    /*Add a blue arc to the start*/
    indic_temp = lv_meter_add_arc(temp_mem_meter, temp_scale, 1, lv_palette_main(LV_PALETTE_BLUE), 0);
    lv_meter_set_indicator_start_value(temp_mem_meter, indic_temp, -40);
    lv_meter_set_indicator_end_value(temp_mem_meter, indic_temp, 10);

    /*Make the tick lines blue at the start of the scale*/
    indic_temp = lv_meter_add_scale_lines(temp_mem_meter, temp_scale, lv_palette_main(LV_PALETTE_BLUE), lv_palette_main(LV_PALETTE_GREY),
                                     true, 0);
    lv_meter_set_indicator_start_value(temp_mem_meter, indic_temp, -40);
    lv_meter_set_indicator_end_value(temp_mem_meter, indic_temp, 10);

    /*Add a red arc to the end*/
    indic_temp = lv_meter_add_arc(temp_mem_meter, temp_scale, 1, lv_palette_main(LV_PALETTE_RED), 0);
    lv_meter_set_indicator_start_value(temp_mem_meter, indic_temp, 50);
    lv_meter_set_indicator_end_value(temp_mem_meter, indic_temp, 105);

    /*Make the tick lines red at the end of the scale*/
    indic_temp = lv_meter_add_scale_lines(temp_mem_meter, temp_scale, lv_palette_main(LV_PALETTE_GREY), lv_palette_main(LV_PALETTE_RED), true, 0);
    lv_meter_set_indicator_start_value(temp_mem_meter, indic_temp, 50);
    lv_meter_set_indicator_end_value(temp_mem_meter, indic_temp, 105);

    /*Add a needle line indicator*/
    indic_temp = lv_meter_add_needle_line(temp_mem_meter, temp_scale, 2, lv_palette_main(LV_PALETTE_GREY), -12);

    ///////////////////////////////////////////
    lv_meter_scale_t * scale;
//    lv_meter_indicator_t * indic;
    create_meter_box(obj_performance, "Memory used", "Total size: 63%", "Memory used: 44%", "Amount of fragmentation: 58%");
    create_temp_box(obj_performance, "Temperature");
    g_meter_timer = lv_timer_create(update_meter_box, 100, NULL);

    /* button event add */
    lv_obj_add_event_cb(imgbtn_widget, widget_event_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_add_event_cb(imgbtn_music, music_event_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_add_event_cb(imgbtn_speed, speed_event_cb, LV_EVENT_RELEASED, NULL);
    lv_obj_add_event_cb(imgbtn_about, about_event_cb, LV_EVENT_CLICKED, obj_main);
    lv_obj_add_event_cb(imgbtn_qrcode, qrcode_event_cb, LV_EVENT_CLICKED, obj_main);
    lv_obj_add_event_cb(imgbtn_setting, setting_event_cb, LV_EVENT_CLICKED, obj_main);
    lv_obj_add_event_cb(imgbtn_picture, picture_event_cb, LV_EVENT_CLICKED, obj_main);
    lv_obj_add_event_cb(imgbtn_file, file_browse_event_cb, LV_EVENT_RELEASED, NULL);
    
    if(!rtc_initialized) {
        rtc_para.year = 2026;
        rtc_para.month = 8;
        rtc_para.day = 1;
        rtc_para.hour = 10;
        rtc_para.minute = 00;
        rtc_para.second = 00;
        rtc_initialized = true;
    }

    /* add main page timing label */
    font_label = lv_label_create(obj_main);
//    lv_obj_set_style_text_font(font_label, &lv_font_digital_35, LV_STATE_DEFAULT);
    lv_obj_set_style_text_font(font_label, &lv_font_digital_30, LV_STATE_DEFAULT);
    lv_label_set_recolor(font_label, true);                      /*Enable re-coloring by commands in the text*/
    lv_label_set_text_fmt(font_label, "#FFFFFF %02d:%02d:%02d", rtc_para.hour, rtc_para.minute, rtc_para.second);
    lv_obj_align(font_label, LV_ALIGN_LEFT_MID, SCALE_POS_X(50), SCALE_POS_Y(-40));

    font_label_year = lv_label_create(obj_main);
//    lv_obj_set_style_text_font(font_label, &lv_font_digital_35, LV_STATE_DEFAULT);
    lv_obj_set_style_text_font(font_label_year, &lv_font_digital_20, LV_STATE_DEFAULT);
    lv_label_set_recolor(font_label_year, true);                      /*Enable re-coloring by commands in the text*/
    lv_label_set_text_fmt(font_label_year, "#FFFFFF %d/%02d/%02d", rtc_para.year, rtc_para.month, rtc_para.day);
    lv_obj_align(font_label_year, LV_ALIGN_LEFT_MID, SCALE_POS_X(50), SCALE_POS_Y(40));
    lv_obj_add_flag(font_label_year, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(font_label_year, year_label_evevt_cb, LV_EVENT_ALL, 0);

    if(g_rtc_timer == NULL) {
        g_rtc_timer = lv_timer_create(rtc_timer, 1000, NULL);
        if(g_rtc_timer) {
            lv_timer_ready(g_rtc_timer);
        }
    }

    img = lv_img_create( obj_performance );
    lv_img_set_src(img, &img_temp);
    lv_obj_align_to(img, temp_mem_meter, LV_ALIGN_CENTER, SCALE_POS_X(0), SCALE_POS_Y(90));
    
    img = lv_img_create( obj_performance );
    lv_img_set_src(img, &img_mem);
    lv_obj_align_to(img, mem_meter, LV_ALIGN_CENTER, SCALE_POS_X(0), SCALE_POS_Y(0));
    if(touch_cursor == NULL) {
        touch_cursor = lv_obj_create(lv_layer_sys());
        lv_obj_set_size(touch_cursor, SCALE_POS_X(20), SCALE_POS_Y(20));
        lv_obj_set_style_bg_color(touch_cursor, lv_color_hex(0xFF0000), 0);
        lv_obj_set_style_radius(touch_cursor, LV_RADIUS_CIRCLE, 0);

        lv_indev_t * indev = lv_indev_get_next(NULL);
        if(indev) {
            lv_indev_set_cursor(indev, touch_cursor);
        }
    }
}


#if SYS_configUSE_FAT32FS
    void lv_demo_app_fs_test(void)
    {

        lv_fs_res_t res;
        lv_fs_file_t f;
        uint8_t buf[100];
        uint8_t WriteBuffer[] = "1232This is FatFs working fine!\r\n";
        uint32_t read_num;
        uint32_t pos = 0;
        res = lv_fs_open(&f, "0:/测试.TXT",LV_FS_MODE_RD | LV_FS_MODE_WR);

        if(LV_FS_RES_OK == res){
            res = lv_fs_write(&f, WriteBuffer, sizeof(WriteBuffer), NULL);
            if(LV_FS_RES_OK == res){
                lv_fs_tell(&f, &pos);
                res = lv_fs_seek(&f, 0, LV_FS_SEEK_SET);
                lv_fs_tell(&f, &pos);
                res = lv_fs_read(&f, buf, 8, NULL);
            }
            lv_fs_tell(&f, &pos);
            lv_fs_close(&f);
            read_num = buf[0];
            read_num = buf[1];
            read_num = buf[2];
        }
    }
#endif
/**********************
 *   STATIC FUNCTIONS
 **********************/

